// Task_1. Написать программу, в которой пользователь вводит три числа a, b и c и затем 
// выводится на экран значение выражения a:c*b (результат округлить до целого числа). 
// Причем, если число с=0, то вывести на экран фразу «На ноль делить нельзя!» 

// let result
// let oneNumber = +prompt('Введите первое число', 0)
// let twoNumber = +prompt('Введите второе число', 0)
// let threeNumber = +prompt('Введите третье число', 0)
// function calc(a,b,c) {
//     return c==0 ? alert('На ноль делить нельзя'): Math.round(a/c*b)
// }

// result = calc(oneNumber,twoNumber,threeNumber)
// alert(result)

//-----------------------------------------------------------------------------------------//

// Task_2. Написать программу, которая вычисляет и выводит на экран периметр 
// и площадь квадрата по введенной пользователем длине a. 

// function calc (){
//     let a = +prompt('Введите первое число', 0)
//     let b = 6
//     let p = (a+b)*2
//     let s = a*b
    
//     if (a<=0) {
//         alert('A не могет <= 0')
//     }
//     else {
//         alert(p)
//         alert(s)
//     }
// }
// alert(calc())

//-----------------------------------------------------------------------------------------//

// Task_3. Напишите программу, в которой вычисляется сумма всех цифр 
// введенного пользователем четырехзначного числа х, а потом определяется, будет ли 
// полученная сумма однозначным или двухзначным числом. Ответ должен быть выведен на 
// экран в виде «Сумма цифр равна … и она является однозначным (двухзначным) числом».

// 50/50

// let result
// let result1
// let oneNumber = +prompt('Введите первое число', 0)
// let twoNumber = +prompt('Введите второе число', 0)
// let threeNumber = +prompt('Введите третье число', 0)
// let fourNumber = +prompt('Введите четвертое число', 0)

//     function calc(a,b,c,d) {
//         return a+b+c+d

//     if (a<10) {
//         alert('однозначное число')
//     }
//     else {
//         alert('двухзначное число')
//     }
//     }

// result = calc(oneNumber,twoNumber,threeNumber,fourNumber)
// result1 = 
// alert(result + result1)

//-----------------------------------------------------------------------------------------//

// Task_4. Посчитайте значение следующего выражения при условии, 
// что пользователь вводит с клавиатуры значения х:

// let a = +prompt('Введите первое число', 0)
// function calc (){
//     let s
    
//     if (a<=0) {
//         alert('A не могет <= 0')
//     }
//     else {
//         alert(p)
//         alert(s)
//     }
// }
// alert(calc())

//-----------------------------------------------------------------------------------------//

// Task_5. Выведите на экран последовательность n первых четных натуральных чисел. 
// Количество чисел n пользователь вводит с клавиатуры.

// let n = +prompt('Введите первое число', 0)

//-----------------------------------------------------------------------------------------//

// Task_6. Пользователь вводит число n с клавиатуры. 
// Используя оператор цикла необходимо вычислить и вывести на экран значение следующего выражения:  

//-----------------------------------------------------------------------------------------//

// Task_7. Напишите программу, которая проверяет, попадает ли введенное 
// пользователем число в диапазон от 5 до 10 включительно 

// let n = +prompt('Введите первое число', 0)

// function calc (){
//     if (n<5) {
//         alert('введенное пользователем число НЕ попадает в диапазон')
//     }
//     else if(n<=10){
//         alert('введенное пользователем число попадает в диапазон')
//     }
//     else if(n>10){
//         alert('введенное пользователем число НЕ попадает в диапазон')
//     }
// }
// alert(calc())

// Task_8. Пользователь вводит три действительных (вещественных) числа. Нужно определить, 
// является ли сумма каких-либо двух из этих чисел положительной.  