// Task_7. Напишите программу, которая проверяет, попадает ли введенное 
// пользователем число в диапазон от 5 до 10 включительно 

// let n = +prompt('Введите первое число', 0)

// function calc (){
//     if (n<5) {
//         alert('введенное пользователем число НЕ попадает в диапазон')
//     }
//     else if(n<=10){
//         alert('введенное пользователем число попадает в диапазон')
//     }
//     else if(n>10){
//         alert('введенное пользователем число НЕ попадает в диапазон')
//     }
// }
// alert(calc())

//-----------------------------------------------------------------------------------------//